# melli code


def codm(a):
    b=list(a)
    if len(b)!=10:
        return ('Your code have not true. Please check numbers')
    l=[]
    for i in b:
        i=int(i)
        l.append(i)
    c=0
    cont=l[9]
    l.reverse()

    for i in range(1, 10):
        c = c + ((i+1)* l[i])
    chec = c%11
    if  chec < 2:
        if cont==chec:
            return('کد صحيح است')    
    elif(11-chec)==cont:
        return('کد صحيح است')
    else:
        return('کد صحيح نيست')

def shahr(c):
    d=int(c)
    shahr={}
    pass




while True:    
    print('enter code melli')
    a=input()
    if a=='':
        break
    print(codm(a), '\n \n\n ****************')


#************************************ sherkat ha

def sherkatcode(a):
    b=list(a)
    if len(b)!=11:
        return ('Your code have not true. Please check numbers')
    l=[]
    for i in b:
        i=int(i)
        l.append(i)
    cont=l[10]
    l.reverse()
    c = 29* l[0]+ 27*l[1]+ 23*l[2]+ 19*l[3]+ 17*l[4]\
        +29* l[5]+ 27*l[6]+ 23*l[7]+ 19*l[8]+ 17*l[9]
    c+= 460
    print ('c',c)
    chec= c%11   
    if chec == 10:
        chec = 0
    print('chec', chec)
    if chec == cont:
        return('code is True')
    else:
        return ('code is False')


shahr={169:' آذرشهر' , 170:'اسکو', ۱۴۹ :'اهر' , 150:'اهر', 171:'بستان	آباد',
       168:'بناب', 136: 'تبریز', 137: 'تبریز' , 138: 'تبریز', 545:'ترکمانچای',
       505:'جلفا', 636:	'چاروایماق', 164:'سراب', 165:'سراب',172:'شبستر',
       623:'صوفیان', 506: ' عجب	شیر', 516:'کلیبر', 154: 'مراغه', 155: 'مراغه',
       ۵۶۷	ورزقان	۱۷۳	هریس	۱۵۹-۱۶۰	هشترود	۶۰۴	هوراند	***	آذربایجان	غربی	۲۷۴-۲۷۵	ارومیه	۲۹۵	اشنویه	۶۳۷	انزل	۲۹۲	بوکان	۴۹۲	پلدشت	۲۸۹	پیرانشهر	۶۷۷	تخت	سلیمان	۲۹۴	تکاب	۴۹۳	چایپاره	۲۷۹-۲۸۰	خوی	۲۸۸	سردشت	۲۸۴-۲۸۵	سلماس	۶۳۸	سیلوانه	۲۹۱	سیه	چشمه(چالدران)	۶۴۰	شوط	۲۹۳	شاهین	دژ	۶۷۵	کشاورز	۲۸۲-۲۸۳	ماکو	۲۸۶-۲۸۷	مهاباد	۲۹۶-۲۹۷	میاندوآب	۲۹۰	نقده	***	همدان	۴۰۰-۴۰۱	اسدآباد	۴۰۴-۴۰۵	بهار	۳۹۷	تویسرکان	۳۹۸-۳۹۹	رزن	۶۴۷	شراء	و	پیشخوار	۵۰۲	فامنین	۵۸۴	قلقل	رود	۴۰۲-۴۰۳	کبودرآهنگ	۳۹۲-۳۹۳	ملایر	۳۹۵-۳۹۶	نهاوند	۳۸۶-۳۸۷	همدان	***	یزد	۵۰۳	ابرکوه	۴۴۴	اردکان	۵۵۱	اشکذر	۴۴۷	بافق	۵۶۱	بهاباد	۴۴۵	تفت	۷۱۸	دستگردان	۸۳	طبس	۴۴۶	مهریز	۴۴۸	میبد	۵۵۲	نیر	۵۴۳	هرات	و	مروست	۴۴۲-۴۴۳	یزد	***	مرکزی	۵۱	آشتیان	۰۵۲-۰۵۳	اراک	۵۸	تفرش	۵۵	خمین	۶۱۷	خنداب	۵۷	دلیجان	۶۱۸	زرند	مرکزی	۰۵۹-۰۶۰	ساوه	۰۶۱-۰۶۲	سربند	۵۴۴	فراهان	۵۶	محلات	۵۷۱	وفس	۵۹۳	هندودر	***	هرمزگان	۶۶۷	ابوموسی	۳۴۸	بستک	۵۸۶	بشاگرد	۳۳۸-۳۳۹	بندرعباس	۳۴۳-۳۴۴	بندرلنگه	۳۴۶	جاسک	۳۳۷	حاجی	آباد	۵۵۴	خمیر	۴۶۹	رودان	۵۳۷	فین	۳۴۵	قشم	۴۷۰	گاوبندی	۳۴۱-۳۴۲	میناب	***	لرستان	۴۸۳-۴۸۴	ازنا	۵۵۷	اشترینان	۴۱۸	الشتر	۴۱۶-۴۱۷	الیگودرز	۴۱۲-۴۱۳	بروجرد	۵۹۲	پاپی	۶۱۲	چغلوندی	۶۱۳	چگنی	۴۰۶-۴۰۷	خرم	آباد	۴۲۱	دورود	۵۹۸	رومشکان	۴۱۹	کوهدشت	۳۸۵	ملاوی(پلدختر)	۴۲۰	نورآباد(دلفان)	۵۲۸	ویسیان	مازندران	۲۱۳-۲۱۴	آمل	۲۰۵-۲۰۶	بابل	۴۹۸	بابل	۵۶۸	بندپی	۷۱۱	بندپی	شرقی	۲۱۷-۲۱۸	بهشهر	۲۲۱	تنکابن	۵۸۲	جویبار	۴۸۳	چالوس	۶۲۵	چمستان	۵۷۶	چهاردانگه	۵۷۸	دودانگه	۲۲۷	رامسر	۲۰۸-۲۰۹	ساری	۲۲۵	سوادکوه	۵۷۷	شیرگاه	۷۱۲	عباس	آباد	۲۱۵-۲۱۶	قائمشهر	۶۲۶	کجور	۶۲۷	کلاردشت	۵۷۹	گلوگاه	۷۱۳	میاندورود	۴۹۹	نکاء	۲۲۲	نور	۲۱۹-۲۲۰	نوشهر	۵۰۰-۵۰۱	هراز	و	محمودآباد	***	گلستان	۶۲۳	آزادشهر	۴۹۷	آق	قلا	۲۲۳	بندرترکمن	۶۸۹	بندرگز	۴۸۷	رامیان	۲۲۶	علی	آباد	۲۲۴	کردکوی	۳۸۶	کلاله	۲۱۱-۲۱۲	گرگان	۶۲۸	گمیشان	۲۰۲-۲۰۳	گنبد	کاووس	۵۳۱	مراوه	تپه	۲۸۸	مینودشت	***	گیلان	۲۶۱	آستارا	۲۷۳	آستانه	۶۳۰	املش	۲۶۴	بندرانزلی	۵۱۸	خمام	۶۳۱	رحیم	آباد	۲۵۸-۲۵۹	رشت	۵۷۰	رضوانشهر	۲۶۵	رودبار	۲۶۸-۲۶۹	رودسر	۶۵۳	سنگر	۵۱۷	سیاهکل	۵۶۹	شفت	۲۶۷	صومعه	سرا	۲۶۲-۲۶۳	طالش	۵۹۳	عمارلو	۲۶۶	فومن	۶۹۳	کوچصفهان	۲۷۱-۲۷۲	لاهیجان	۶۹۴	لشت	نشاء	۲۷۰	لنگرود	۵۱۶	ماسال	و	شاندرمن	***	کرمانشاه	۳۳۳-۳۳۴	اسلام	آباد	۶۹۱	باینگان	۳۲۳-۳۲۲	پاوه	۵۹۵	ثلاث	باباجانی	۳۹۵	جوانرود	۶۴۱	حمیل	۵۹۶	روانسر	۳۳۶	سرپل	ذهاب	۳۳۵	سنقر	۴۹۶	صحنه	۳۳۷	قصرشیرین	۳۲۴-۳۲۵	کرمانشاه	۳۹۴	کرند	۳۳۰	کنگاور	۳۳۲	گیلانغرب	۳۳۱	هرسین	***	کهکیلویه	و	بویراحمد	۶۸۷	باشت	۴۲۲-۴۲۳	بویراحمد(یاسوج)	۵۹۹	بهمنی	۶۰۰	چاروسا	۶۸۸	دروهان	۴۲۴-۴۲۵	کهکیلویه(دهدشت)	۴۲۶	گچساران(دوگنبدان)	۵۵۰	لنده	۶۹۷	مارگون	***	کردستان	۳۸۴	بانه	۳۷۷-۳۷۸	بیجار	۵۵۸	دهگلان	۳۸۵	دیواندره	۶۴۶	سروآباد	۳۷۵-۳۷۶	سقز	۳۷۲-۳۷۳	سنندج	۳۷۹-۳۸۰	قروه	(نیازمند	تایید	توسط	بازدیدکننده	ها)۳۸۳	کامیاران	۶۷۴	کرانی	۳۸۱-۳۸۲	مریوان	۶۷۶	نمشیر	***	کرمان	۷۲۲	ارزونیه	۵۴۲	انار	۳۱۲-۳۱۳	بافت	۳۱۷	بردسیر	۳۱۰-۳۱۱	بم	۳۰۲-۳۰۳	جیرفت	۵۸۳	رابر	۳۲۱	راور	۳۸۲	راین	۳۰۴-۳۰۵	رفسنجان	۵۳۶	رودبار	کهنوج	۶۰۵	ریگان	۳۰۸-۳۰۹	زرند	۳۰۶-۳۰۷	سیرجان	۳۱۹	شهداد	۳۱۳-۳۱۴	شهربابک	۶۰۶	عنبرآباد	۳۲۰	فهرج	۶۹۸	قلعه	گنج	۲۹۸-۲۹۹	کرمان	۵۳۵	کوهبنان	۳۱۵-۳۱۶	کهنوج	۳۱۸	گلباف	۶۰۷	ماهان	۶۰۸	منوجان	***	قزوین	۵۰۸	آبیک	۵۳۸	آوج	۷۲۸	البرز	۵۰۹	بوئین	زهرا	۴۳۸-۴۳۹	تاکستان	۵۸۰	رودبار	الموت	۵۹۰	رودبار	شهرستان	۵۵۹	ضیاءآباد	۵۸۸	طارم	سفلی	۴۳۱-۴۳۲	قزوین	***	قم	۰۳۷-۰۳۸	قم	۷۰۲	کهک	***	فارس	۲۴۰-۲۴۱	آباده	۶۷۰	آباده	طشک	۶۴۸	ارسنجان	۲۵۲	استهبان	۶۷۸	اشکنان	۲۵۳	اقلید	۶۴۹	اوز	۵۱۳	بوانات	۵۴۶	بیضا	۶۷۱	جویم	۲۴۶-۲۴۷	جهرم	۶۵۴	حاجی	آباد(زرین	دشت)	۵۴۸	خرامه	۵۴۷	خشت	و	کمارج	۶۵۵	خفر	۲۴۸-۲۴۹	داراب	۲۵۳	سپیدان	۵۱۴	سروستان	۶۶۵	سعادت	آباد	۶۷۳	شیبکوه	۲۲۸-۲۲۹-۲۳۰	شیراز	۶۷۹	فراشبند	۲۵۶-۲۵۷	فسا	۲۴۴-۲۴۵	فیروزآباد	۶۸۱	قنقری(خرم	بید)	۷۲۳	قیروکارزین	۲۳۶-۲۳۷	کازرون	۶۸۳	کوار	۶۵۶	کراش	۲۵۰-۲۵۱	لارستان	۵۱۵	لامرد	۲۴۲	–	۲۴۳	مرودشت	۲۳۸-۲۳۹	ممسنی	۶۵۷	مهر	۲۵۵	نی	ریز	***	سمنان	۶۸۴	ایوانکی	۷۰۰	بسطام	۶۴۲	بیارجمند	۴۵۷	دامغان	۴۵۶	سمنان	۴۵۸-۴۵۹	شاهرود	۴۶۰	گرمسار	۵۳۰	مهدیشهر	۵۲۰	میامی	***	سیستان	و	بلوچستان	۳۵۸-۳۵۹	ایرانشهر	۶۸۲	بزمان	۷۰۳	بمپور	۳۶۴-۳۶۵	چابهار	۳۷۱	خاش	۷۰۱	دشتیاری	۷۲۰	راسک	۳۶۶-۳۶۷	زابل	۷۰۴	زابلی	۳۶۱-۳۶۲	زاهدان	۳۶۹-۳۷۰	سراوان	۶۳۵	سرباز	۶۶۸	سیب	و	سوران	۵۳۳	شهرکی	و	ناروئی(زهک)	۷۰۵	شیب	آب	۶۹۹	فنوج	۶۶۹	قصرقند	۷۲۵	کنارک	۵۹۷	لاشار(اسپکه)	۶۱۱	میرجاوه	۵۲۵	نیک	شهر	***	خوزستان	۱۸۱	آبادان	۵۲۷	آغاجاری	۵۸۵	اروندکنار	۶۸۵	امیدیه	۶۶۳	اندیکا	۱۹۲-۱۹۳	اندیمشک	۱۷۴-۱۷۵	اهواز	۱۸۳-۱۸۴	ایذه	۴۸۱	باغ	ملک	۷۰۶	بندر	امام	خمینی	۱۹۴-۱۹۵	بندرماهشهر	۱۸۵-۱۸۶	بهبهان	۱۸۲	خرمشهر	۱۹۹-۲۰۰	دزفول	۱۹۸	دشت	آزادگان	۶۶۲	رامشیر	۱۹۰-۱۹۱	رامهرمز	۶۹۲	سردشت	۱۸۹	شادگان	۷۰۷	شاوور	۵۲۶	شوش	۱۸۷-۱۸۸	شوشتر	۷۲۹	گتوند	۷۳۰	لالی	۱۹۶-۱۹۷	مسجدسلیمان	۶۶۱	هندیجان	۶۸۰	هویزه	***	خراسان	رضوی	۶۴۳	احمدآباد	۵۶۲	بجستان	۵۷۲	بردسکن	۷۴	تایباد	۶۴۴	تخت	جلگه	۰۷۲-۰۷۳	تربت	جام	۰۶۹-۰۷۰	تربت	حیدریه	۵۲۱	جغتای	۵۷۳	جوین	۵۲۲	چناران	۷۲۴	خلیل	آباد	۷۶	خواف	۷۷	درگز	۶۵۰	رشتخوار	۵۷۴	زبرخان	۰۷۸-۰۷۹	سبزوار	۸۱	سرخس	۸۴	فریمان	۶۵۱	فیض	آباد	۰۸۶-۰۸۷	قوچان	۰۸۹-۰۹۰	کاشمر	۵۵۳	کلات	۹۱	گناباد	۰۹۲-۰۹۳-۰۹۴	مشهد	۹۷	مشهد	منطقه۲	۹۸	مشهد	منطقه۳	۹۶	مشهد	منطقه۱	۱۰۵-۱۰۶	نیشابور	***	خراسان	شمالی	۶۳	اسفراین	۰۶۷-۰۶۸	بجنورد	۷۵	جاجرم	۵۹۱	رازوجرکلان	۸۲	شیروان	۶۳۵	فاروج	۵۲۴	مانه	و	سملقان	***	چهارمحال	و	بختیاری	۴۶۸	اردل	۴۶۵	بروجن	۴۶۱-۴۶۲	شهرکرد	۴۶۷	فارسان	۶۳۲	فلارد	۵۵۵	کوهرنگ	۶۳۳	کیار	۶۲۹	گندمان	۴۶۶	لردگان	۶۹۶	میانکوه	***	خراسان	جنوبی	۷۲۱	بشرویه	۰۶۴-۰۶۵	بیرجند	۵۲۳	درمیان	۶۵۲	زیرکوه	۷۱۹	سرایان	۷۱۶	سربیشه	۸۵	فردوس	۸۸	قائنات	۵۶۳	نهبندان	***	بوشهر	۵۲۹	بندر	دیلم	۳۵۳	بندر	گناوه	۳۴۹-۳۵۰	بوشهر	۳۵۵	تنگستان	۶۰۹	جم	۳۵۱-۳۵۲	دشتستان	۳۵۴	دشتی	۷۳۲	دلوار	۳۵۷	دیر	۵۳۲	سعد	آباد	۶۱۰	شبانکاره	۳۵۶	کنگان	***	تهران	۵۵۶	اسلامشهر	۶۵۸	پاکدشت	۰۰۱-۰۰۲-۰۰۳-۰۰۴-۰۰۵-۰۰۶	۰۰۷-۰۰۸	تهران	مرکزی	۱۱	تهران	جنوب	۲۰	تهران	شرق	۲۵	تهرانشمال	۱۵	تهران	غرب	۴۳	دماوند	۶۶۶	رباط	کریم	۴۸۹	ساوجبلاغ	۰۴۴-۰۴۵	شمیران	۰۴۸-۰۴۹	شهرری	۴۹۰-۴۹۱	شهریار	۶۹۵	طالقان	۶۵۹	فیروزکوه	۰۳۱-۰۳۲	کرج	۶۶۴	کهریزک	۷۱۷	نظرآباد	۰۴۱-۰۴۲	ورامین	***	امور	خارجه	۴۷۱-۴۷۲	امور	خارجه	***	ایلام	۴۵۴	آبدانان	۵۸۱	ارکوازی(ملکشاهی)	۴۴۹-۴۵۰	ایلام	۶۱۶	ایوان	۵۳۴	بدره	۴۵۵	دره	شهر	۴۵۱	دهلران	۷۲۶	زرین	آباد	۶۳۴	شیروان	لومار	۴۵۳	شیروان	و	چرداول	۷۲۷	موسیان	۴۵۲	مهران	***	اردبیل	۱۴۵-۱۴۶	اردبیل	۷۳۱	ارشق	۶۹۰	انگوت	۶۰۱	بیله	سوار	۵۰۴	پارس	آباد	۱۶۳	خلخال	۷۱۴	خورش	رستم	۷۱۵	سرعین	۵۶۶	سنجبد(کوثر)	۱۶۶-۱۶۷	مشکین	شهر	۱۶۱-۱۶۲	مغان	۶۸۶	نمین	۶۰۳	نیر	***	اصفهان	۶۱۹	آران	و	بیدگل	۱۱۸	اردستان	۱۲۷-۱۲۸-۱۲۹	اصفهان	۶۲۰	باغ	بهادران	۶۲۱	بوئین	و	میاندشت	۵۴۹	تیران	و	کرون	۵۶۴	جرقویه	۵۷۵	چادگان	۱۱۳-۱۱۴	خمینی	شهر	۱۲۲	خوانسار	۵۴۰	خور	و	بیابانک	۶۶۰	دولت	آباد	۱۲۰	سمیرم	۵۱۲	سمیرم	سفلی	(دهاقان)	۵۱۰-۵۱۱	شاهین	شهر	۱۱۹	شهرضا	۱۱۵	فریدن	۱۱۲	فریدونشهر	۱۱۰-۱۱۱	فلاورجان	۱۲۵-۱۲۶	کاشان	۵۶۵	کوهپایه	۱۲۱	گلپایگان	۱۱۶-۱۱۷	لنجان(زرینشهر)	۵۴۱	مبارکه	۶۲۲	میمه	۱۲۴	نائین	۱۰۸-۱۰۹	نجف	آباد	۱۲۳	نطنز	متفرقه	متفرقه	از	همه	استان	ها	۴۲۸	–	۴۲۷	زنجان	۵۰۷	ملکان	۱۵۸	مرند	۶۱۵	ابهر	و	خرمدره	۱۵۲	–	۱۵۳	میانه						
}





